{
    "frog-facts":[
        "A frog is an amphibian.",
        "There are over 5000 frog species found in the world.",
        "Frogs breathe through their nostrils.",
        "Some frogs can jump over 20 times of their own body height.",
        "Frogs do not need to drink water as they absorb it through their skin.",
        "The frog’s colorful skin acts as a caution to predators that these frogs may be poisonous.",
        "The study of frogs is called Herpetologists.",
        "An ear of the frog is called tympanum and it is located just behind the eye.",
        "Frogs sleep with their open eyes.",
        "Each frog species has a distinct croak.",
        "Frogs swallow their food using their eyes.",
        "There is a frog in Indonesia that has no lungs.",
        "A group of toads is called a ‘knot’.",
        "The world’s biggest frog is the Goliath frog.",
        "There is another type of poison dart frog called the blue-jeans frog.",
        "A group of frogs is called an ‘army’.",
        "The Ornate Horned is the most aggressive frog.",
        "Frogs cannot live in the sea or any salt water.",
        "Frogs have a sticky tongue and use its muscular tongue to catch and swallow food.",
        "Frogs hibernate in the winter time.",
        "The golden dart frog’s skin could kill up to 1,000 people.",
        "Frog legs are eaten by humans in many parts of the world.",
        "In warmer water, the eggs of frogs grow faster.",
        "There are two frogs in the world that have tails, the coastal tailed frog and the mountain tailed frog.",
        "Every type of frog makes its own special sound.",
        "Frogs and Toads have flattened skulls.",
        "The Cuban tree toad is one of the smallest frogs in the world.",
        "Frogs have a great night vision.",
        "The average lifespan of a frog is between 10 to 14 years.",
        "Not all frogs have webbed toes.",
        "Female frogs are hard to find as they are silent most of the time.",
        "Frogs can be found everywhere on Earth except Antarctica.",
        "African frogs are the best jumpers in the frog world.",
        "The purple frog rediscovered in India has no head.",
        "Frogs stop growing once they reach adulthood.",
        "The longest jump ever recorded by frog was 33.6 inches.",
        "Frogs are carnivores, which means they eat meat.",
        "Frogs who have no tongues use their fingers to catch prey.",
        "Frogs have a moist skin layer which is covered with mucous glands.",
        "Tadpoles have no lungs, they have gills.",
        "Frogs absorb water through their skin so they don't need to drink.",
        "Frogs can lay as many as 4,000 eggs in frogspawn.",
        "The eyes and nose of a frog are on top of its head so it can breathe and see when most of its body is under the water.",
        "Frogs have long back legs and webbed feet for jumping and swimming.",
        "The world's biggest frog is the goliath frog from Cameroon in West Africa. Their body can be one-foot long.",
        "The smallest frogs in the world are less than half-an-inch long.",
        "In the Seychelles, there is a male frog that carries its young around on its back until they become adults.",
        "Frog bones form a new ring every year when the frog is hibernating, just like trees do. Scientists can count these rings to discover the age of the frog.",
        "Because frogs come out in the rain, people used to think that they fell to earth in the rain! And in nineteenth century England, people tried catching them to prove it.",
        "One type of desert frog can wait as long as seven years for water by surrounding itself in a type of transparent bag that becomes its first meal once the rain comes.",
        "Amphibians' eyes come in all shapes and sizes. Some even have square or heart shaped pupils. But amphibians don't see color -- they only see in black or white.",
        "The golden dart frog is the most poisonous frog on earth and the skin of one frog could kill up to 1,000 people.",
        "In recent years, a painkiller with 200 times the power of morphine has been found in the skin of a frog.",
        "The male Darwins Frog takes its mate's eggs into its mouth as soon as they show signs of life and they stay there until they emerge as fully grown froglets.",
        "Many of the most brightly colored tropical frogs are colored in this way to warn predators that they are poisonous."
    ]
}